
public class OOP {
	/* 
	 *객체지향 프로그래밍(Object Oriented Programming)
	 * 	 우리 일상에서이루어지고있는 업무를 객체(Object)를 사용해서
	 *   프로그래밍하는방법
	 *   
	 *    1. 실제 주차장관리 업무파악
	 *      (객체를 도출하고 그객체들의 관계에의한 업무파악) 
	 *    2. 프로그램으로 작성 
	 *      (1번에서 파악된업무를 메모리상에서 그대로구현) 
	 *   
	 *    ex> 주차관리 프로그램 
	 *     
	 * 
	 * 	 - 객체(업무):실제이루어지고있는 업무(주차장)에서 보여지고
	 *               구체화되어있는 사물(차)    
	 *   
	 *   - 객체(프로그램):실제이루어지고있는 업무(주차장)에서 보여지고
	 *                  구체화되어있는 사물을 메모리의 데이타로
	 *                  표현한것(차의데이타)
	 * 
	 *                   
	 *    객체지향 장점 : 객체 재사용, 유지 보수 및 확장성 용이 하여 대규모 소프트웨어 개발에 많이사용
	 *    객체지향을 잘 알아야 유지보수 확장을 잘 할수있다 
	 *    붕어빵틀을 클래스, 붕어빵을 객체 로 비유
	 *    식별가능 하고 데이터 (자신의 특성과 정보) 를 가지며 자기 자신의 데이터를 바탕으로 하는 행위
	 *    상태 - 데이터 와 행위 - 출력
	 *    소프트웨어 객체 - 인스턴스 - 실제 메모리상에 존재하는 객체  
	 *    
	 *    
	 *    
	 */
}
